export default
{
    // 正整数
    "Pattern.Positive.Integer": /^[1-9]{1}\d*$/,
    
    // 六位验证码
    "Pattern.Verification": /^\d{6,}$/,

    // 正整数，两位小数点
    "Pattern.Positive.Integer.Two.Point": /^(([1-9][0-9]*)|([0]\.\d{1,2}|[1-9][0-9]*\.\d{1,2}))$/,
    
    // 手机
    "Pattern.Cellphone": /^((\+|00)86\s*[-\.]?)?\s*(1\d{2})((\s*)|(-?))(\d{4})((\s*)|(-?))(\d{4})$/,

    // 用户名 5-20位英文+数字验证（不包括特殊符号即中文）

    "Pattern.UserName": /^[a-zA-Z0-9]{5,20}$/,

    // 身份证
    "Pattern.Identity.Card": /^([1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx])|([1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2})$/,

    // 数字验证（不能为负数）
    "Pattern.RealNo":/^[0-9]+.?[0-9]*$/
};